const newsList = [
  {
    id: 1, // 流水號
    type: "公告", // 類別
    title: "即日起營業時間小幅修改", // 標題
    description:
      "校的名方成以高：落出保表她一期很強開內年制當是過位你查大話中明個四源：開時是苦子子理經三的子起一斯前在輕家也感野紅決了實兒西速評為員的全有聽外故體色點居。油散解反人樓少切把國無！品發球線古下校理改今包著料正她男學的始賣信觀德工王代南營行來一以有的子坡年使動動心意步清不著不全個馬臺發大長率外地高王月！", // 描述
    content:
      "桌面金融承受隨着或許引擎報名幾個點點版面填寫喜歡購買，職業預覽她是家人今後球隊製造重複選單職業，立刻出去武器對於關係商家結構偉大，用戶對你刷新正式成立解決方案少年地上，旅遊好友員工一本面對樹林眼光調。變成措施魔獸必然都不模樣表演出發，皇帝各種風情是在誘惑新浪一番轉貼不如都市年輕自主出處鍵盤，帳號責任一批這個問題公佈以及居然，穩定你不類別年度存在將軍投票點此生存黃金多媒體溫度形象，樂隊意見，東方總算清晰付出證書一樣，辦公室數學不要未來個性證券手中，部門。並非街道實際一口氣某種衝突書庫報導萬華受到，進一步明星日期體系烏日分鐘提到風格檔案，明顯求職列表白色賓館機械顯卡健康增長不見玻璃，見過許可為主地方玩家如果毫不也在請大家，工人接口舉報資訊單位師傅，女友為主社會主義付款如有一部虛擬供求需要還沒有，痛苦設定，優化我一當前位置心情地說下午不夠中央前進收費經歷，出版技巧搜尋引擎承受印度浙江屬性學校一家重要實驗其他的功能，他就裝飾安全操作系統寫真這麼多，並不是套件食品保障計算改革能量，工業暫時電池做法面臨控制思維嚴重我就全國，位置你說，使得夏天控制說到程式兩年保證面對證書考生咱們文件產品實用，明年這次公告服務老公結構大學暴力網頁課程按鈕方式不可，大連提。", // 內文
    img: "https://source.unsplash.com/ETRPjvb0KM0/500x500", // 圖片
    time: "2021-08-01", // 發布時間
  },
  {
    id: 2, // 流水號
    type: "公告", // 類別
    title: "大個具有樹裡歡青會", // 標題
    description:
      "位的色就品：管解續爸明果參熱都前直嗎我式備讓因年動而會用參開……野步統歷女；各著流線醫前都做把曾賽一解會面會藥我間陸媽寶大可上題字入，期設中，上求在不了先我的又醫然。而世西生，品用清三；就海月安了作新意成？", // 描述
    content:
      "整生點程送足的是異保查哥件道用是相課色元我書陸光保常了千來件房住路人能是教羅，葉現形成都只給相印來經要皮家大國不這的可長五師你生命再著山史畫公我停高？需收次。其拿不力轉子們子長帶運情會？全究怎研國音類星油合的進岸之筆出地關灣主照集不平到趣是時二、行生中，設民眼行義響紅頭知離文共後出你工請一的金開失因大這讓日內引親成特交字師。有題後想說其施英；走料她看有入風的用史；定爭達因。", // 內文
    img: "https://source.unsplash.com/DmO662qvWO8/500x500", // 圖片
    time: "2021-07-29", // 發布時間
  },
  {
    id: 3, // 流水號
    type: "活動", // 類別
    title: "香就所指基樂到得是有了之告即", // 標題
    description:
      "外他別資送線文聲市此。為著影指東達，夠時生些幾河室做到確。一合兩一設功分，高引者……但就著招學企我世那用腳要運下著除死傳的別地告處設，樂將不受買；計構校度……照建引，解難體民！代或了切！具她全家我我年辦子身。動少交定理，不做而子人注見中值所自，現影在雖成進力！先天我有特回為生有面不不結調活現。", // 描述
    content:
      "構在放了少開少制？者說通爸畫我專傳。建個差工是你不無現覺裡如實量影，非一經此的議了天好望車要五接，聯使進會說表在業山維維，應印空不。間老性要眼以。顯資演名舞問於場中青以不，管長印那而是，一雙中望，斷功高，王人路雄西空上；個策飯然，包第至我，爸就訴化花中：名條還夜市了的設政！上在水心構新他布弟花視叫成黑改市而什有度人程開原空復美從亞夫就言人人一院電老品事十治同時起起業深痛而聲與世本他麼花。是景以。單供生學檢除，顧情代團信綠在林青廣自酒！爸國何體能。", // 內文
    img: "https://source.unsplash.com/U3zasaqWD-I/500x500", // 圖片
    time: "2021-07-20", // 發布時間
  },
  {
    id: 4, // 流水號
    type: "活動", // 類別
    title: "一良的法要標小流意如大易類傷", // 標題
    description: "提意節著市色使來代名亞，如不國孩室省爸名……裡統視稱黑務中歷經，雖間而改量型久然地行業系衣演著視。展人回險，生人。", // 描述
    content:
      "中些破出己間到險。八局長音有地住，會於幾及，裡和的，回間山國受不們不寫學員深中了因呢首！連水細的各出出同都動準這做加往態的！人中到，裡水手政，合其速面際和效球好。表不事年、相錢正……供色為表葉了心道定……同引戰作車而話，現技裡收十星界景又真外報面；見去流身破的的斷太華但氣可水業多國教著城備麼會程能界的顯地？只海包月覺際才日年讓裡業排還好而他上少了改團主於到。果人臺評水，國爸發就我近落國失服的用都？臺見獨山條電日的技女著實上他安事美支區歷能大否痛說傳客吃基離稱高，在汽心的展學山！一片國上人？了我老子方價業家主畫輕傳館場學能，好出業情在自圖白天越資境車會取且求離完善會有至良腦這目時算象直組跟清年可飛作叫朋大久是廣初用：神失認要大過星覺著、國而是設行止！運候為速要率錢時得細布身。", // 內文
    img: "https://source.unsplash.com/sTPy-oeA3h0/500x500", // 圖片
    time: "2021-07-11", // 發布時間
  },
  {
    id: 5, // 流水號
    type: "活動", // 類別
    title: "重而思人成樣", // 標題
    description: "富車性一，可業合排晚黨主舉定自源，集傳來制般名灣一聽，因係只有心原都無部習的導表麗我工引？行向起，男士個電下代是！物線自然後麼灣……不交該生然，弟好雙造性價火以是。", // 描述
    content:
      "於際馬果去去羅那己然力幾你亮叫離相操無果；示在日局極；做有怎數念在出以、這大不軍政童麼保還華球行科收完別洋人小故示界康藝流灣燈葉就人開服拿里提下服了開才的費上小她性入調看毛病寫可不對不戲又陸沒節使英便文報，小坐他被上與：不木病觀展事，為養連研院，到人我高散喜代小化老上三子小著？了生者產無沒斯平世服會如且氣響化上問的時對散如天……城條型男、樣少導麼活，導山生什本意樹度多人看土安消還時持人，題能當用，記身量我算成光我但的人眼動有片營：手市政亮：長子友銀著的現重世把好集我公應市不學。因議商亞說媽笑相的出招檢著家導導的你，裡習著得的不養設治起立半的助孩式一望南這天乎舉回興孩至間管過冷價；是結他政麼紅，看必間，客東和仍得興全原見有寫仍定感言百上是以間不青在有加遊康中廣來當會苦推飛成看為須學天懷位那育真……安病上黑量，美紀從樂我：局日政，他黨有險任孩，說加之，到農多。國對紀醫多不操，都土常小目力小邊去麼洋改北的語近間。", // 內文
    img: "https://source.unsplash.com/_HtKNv8zs5s/500x500", // 圖片
    time: "2021-07-05", // 發布時間
  },
  {
    id: 6, // 流水號
    type: "公告", // 類別
    title: "市個元道排雨會每", // 標題
    description: "資自他思！空我外成友成場體北商識再巴問南以育新建家樓，病大美：和兒這注南格！自不天去三善廣的需入歷童……樂強委回此帶都氣假；向一點。表電合，古知強二，易如！", // 描述
    content:
      "推種給道說神：讀魚為拿我們兒來：我久就口件全一共出一重器場活同可麼員未會的：高雖人己行家石動認站待共看場覺，建步象蘭通術吸劇一字不最沒長打下緊，腦念到手就然己自來在參為非如我去心南好的母信到元花說？再大是飯；人料向發操便民品可口不開師老中密，和房外動長了上車，形美家步天這由更作先己中我集至。樣種部結前行優飛內孩打正飯意導學新人該可點阿熱男問要詩毛好石到天雖門樂，子特得作情；下一海大親驗體終利大大記獨，以我的體處無呢出！外資表活而進樣企路香北之和間獎吃有外來他場面……策整孩不黨下施問。自見著，先打官別到回水子獎實……無生花常一就我是各。導球研如臉兒美認使孩議賽技親人高進，三才一？海數經房經想友準有兒去期可學我說別強果源別演車提方！懷是引來車現些國全友質了庭型統紅，家的海知民。", // 內文
    img: "https://source.unsplash.com/ETRPjvb0KM0/500x500", // 圖片
    time: "2021-06-28", // 發布時間
  },
  {
    id: 7, // 流水號
    type: "公告", // 類別
    title: "心者者建息時不", // 標題
    description:
      "突如親趣緊把生充會重產相兒夜的。高方什、於早我我樣交。手教失選人有像。遊一去。收也給，只時會，現上處意作節全地已經二管對、正任年電流……為一族者問，多我動地圖我子靜應德！不北路字期能在會管是分生四物少。門的以定外水天，立當下年子面提寶地委經：各皮地本處向麼但一保便員要，登視常長女而班會標木他子實，打要門，越孩面年天想；小許心用水。改顧怕立業電人日到前許；內像個義德！今不上和的商男歡後時這的愛；不共建向風皮演弟地風念滿、適體二驚服立價低景景現輪大；星學影思致影此國內勢不法定子稱注故求受景準！", // 描述
    content:
      "而人居國來？名下我興告溫異。個賣你方交定，情界遊石庭母！步不好查經起賽反要包題人程？國例容！日成早鄉氣相月大傳學在少的們老喜一是舞的兒成？意合是之寫小們香，終定後大民東話！女水刻加狀流會陽中：樂學麼當容係們接手四員眾新養皮門一中書紙是些，區企片表條候車我星。西風前音共食身注用以變的也；回母業，小節麼只究特市有票的立內作。現來上資子和重都比軍壓木，第深時期導如心談他從達人？品像位至入變候我任間政代們子於上是、能出鄉事外曾，開同別氣部次很較打不民方地要學的他作進大，原一層影太門及用亞流；當檢那美未完來隊我面動學人。", // 內文
    img: "https://source.unsplash.com/ETRPjvb0KM0/500x500", // 圖片
    time: "2021-06-22", // 發布時間
  },
  {
    id: 8, // 流水號
    type: "活動", // 類別
    title: "有傳動平自一近各怕要程國我西", // 標題
    description:
      "體必童是望樣卻：也別龍造色覺縣法性就地遠……命部天做個而己形持青會一能值多這望康興的……自位否北興傷電務……速金在之五聞這小很少慢道經。眼近不品語腦開；美長表工庭？讀續如去那由水，今調創急更對地現會資願女的怎實農？就門和個著認牛太人案帶去理代有時太信，國影那路正？方可文轉命。事機模灣說用人們說電師查著，藥社初，創不當的對家自率影斯致往家信保民的上沒風資公美期國標；是案需賽牛量看領像生務，下重展；水這清；歡怎動就型國話，一例民身爸是總謝目沒？", // 描述
    content:
      "而期南個多運都時觀呢！人坡效富代手續會絕語的先兒企市備心西子管，馬來生月這海又的後然因書定龍可日著行多、數的車十：樣人氣夠黃；他陸媽卻廣回終說，再生片黃！得友等例小比不；教現知高、起即不我天些十看以單他由我如：英藥續識高上士可作記回場能環天生行。家達不舞重。麼國經：最公政再，會技生食題分高的著不園後會故離……接世道最專造的海朋覺紀提文，什和而可望害格空風，水界高動人心的的是廣義空記三安一，看生注見如受了為會親果子，就手何感呢是：目年他色地命臺更草致做養持深教五時學來嚴。醫水學了是到難或統面能星進是會大斯長，青業本值形自人安年，了現上我會不和陸位小己打球大；樣間它農近門、個想通參了木中小機展策之反大覺正是味。備車他計難他兩時單樣面點麼臺應美輕讀美合己魚來音有科人父快意。過育我電，技麼以設，人上新民命那，幾的不連又夫孩，視道共我委禮，靈資施品假成技……點些身他會可由光為年因的選就同看女民！腳告半表告無大……類快年世易最聲軍車當飯時。這節候日毒理是滿由合學把親。", // 內文
    img: "https://source.unsplash.com/_HtKNv8zs5s/500x500", // 圖片
    time: "2021-06-15", // 發布時間
  },
];
const News = {
  // 取得訊息清單
  getNews() {
    let news = [];
    newsList.forEach((item) => {
      let news = {
        id: item.id,
        type: item.type,
        title: item.title,
        description: item.description,
        img: item.img,
        time: item.time,
      };
      news.push(news);
    });
    return news;
  },
  // 取得詳細訊息
  getNewsById(newsId) {
    let news = {};
    newsList.forEach((item) => {
      if (item.id == newsId) {
        let result = {
          id: item.id,
          type: item.type,
          title: item.title,
          content: item.content,
          img: item.img,
          tiem: item.time,
        };
        news = result;
      }
    });
    return news;
  },
  // 取得訊息標題(for 首頁)
  getHomeNews() {
    // 暫定取前十筆
    let homeNews = [];
    newsList.forEach((item) => {
      let news = {
        id: item.id,
        type: item.type,
        title: item.title,
      };
      homeNews.push(news);
    });
    console.log(homeNews);
    return homeNews;
  },
};
// FIXME 之後會改成查後端
export default News;
