export default {
  name: "NewsList",
  data() {
    return {
      // 當前頁數
      currentPage: 1,
      // 資料總筆數
      rows: 100,
      // 每頁顯示筆數
      perPage: 4,
      // 置頂訊息
      msgTop: {
        id: 2,
        title: "[公告] 即日起營業時間小幅修改",
        description:
          "校的名方成以高：落出保表她一期很強開內年制當是過位你查大話中明個四源：開時是苦子子理經三的子起一斯前在輕家也感野紅決了實兒西速評為員的全有聽外故體色點居。<br>油散解反人樓少切把國無！品發球線古下校理改今包著料正她男學的始賣信觀德工王代南營行來一以有的子坡年使動動心意步清不著不全個馬臺發大長率外地高王月！",
        image: "https://source.unsplash.com/ETRPjvb0KM0/500x500",
        created_at: "2021-08-01",
      },
      // 訊息列表項目
      msgArr: [
        {
          id: 5,
          title: "[活動] 當月壽星打卡即可獲得精美小禮!",
          description:
            "校的名方成以高：接同個你標，成或香：落出保表她一期很強開內年制當是過位你查大話中明個四源：開時是苦子子理經三的子起一斯前在輕家也感野紅決了實兒西速評為員的全有聽外故體色點居。<br>油散解反人樓少切把國無！一下我、稱字銀不；品發球線古下校理改今包著料正她男學的始賣信觀德工王代南營行來一以有的子坡年使動動心意步清不著不全個馬臺發大長率外地高王月！",
          image: "https://source.unsplash.com/DmO662qvWO8/500x500",
          created_at: "2022-01-01",
        },
        {
          id: 4,
          title: "[活動] 雙十國慶優惠活動開始囉!",
          description:
            "校的名方成以高：落出保表她一期很強開內年制當是過位你查大話中明個四源：開時是苦子子理經三的子起一斯前在輕家也感野紅決了實兒西速評為員的全有聽外故體色點居。<br>油散解反人樓少切把國無！品發球線古下校理改今包著料正她男學的始賣信觀德工王代南營行來一以有的子坡年使動動心意步清不著不全個馬臺發大長率外地高王月！",
          image: "https://source.unsplash.com/U3zasaqWD-I/500x500",
          created_at: "2021-10-01",
        },
        {
          id: 3,
          title: "[公告] 五倍券優惠禮，消費滿300折50元!",
          description:
            "校的名方成以高：落出保表她一期很強開內年制當是過位你查大話中明個四源：開時是苦子子理經三的子起一斯前在輕家也感野紅決了實兒西速評為員的全有聽外故體色點居。<br>油散解反人樓少切把國無！品發球線古下校理改今包著料正她男學的始賣信觀德工王代南營行來一以有的子坡年使動動心意步清不著不全個馬臺發大長率外地高王月！",
          image: "https://source.unsplash.com/_HtKNv8zs5s/500x500",
          created_at: "2021-10-01",
        },
        {
          id: 1,
          title: "[活動] 打卡送飲品! 凡消費加打卡，tag店家帳號，免費送一杯飲品! 不限金額品項，有打有送!",
          description:
            "校的名方成以高：落出保表她一期很強開內年制當是過位你查大話中明個四源：開時是苦子子理經三的子起一斯前在輕家也感野紅決了實兒西速評為員的全有聽外故體色點居。<br>油散解反人樓少切把國無！品發球線古下校理改今包著料正她男學的始賣信觀德工王代南營行來一以有的子坡年使動動心意步清不著不全個馬臺發大長率外地高王月！",
          image: "https://source.unsplash.com/sTPy-oeA3h0/500x500",
          created_at: "2021-05-15",
        },
      ],
    };
  },
  methods: {},
};
