export default {
  name: "NewsDetail",
  data() {
    return {
      // 訊息內容
      msg: {
        id: 2,
        // 標題
        title: "[公告] 即日起營業時間小幅修改",
        // 簡介
        description:
          "校的名方成以高：落出保表她一期很強開內年制當是過位你查大話中明個四源：開時是苦子子理經三的子起一斯前在輕家也感野紅決了實兒西速評為員的全有聽外故體色點居。<br>油散解反人樓少切把國無！品發球線古下校理改今包著料正她男學的始賣信觀德工王代南營行來一以有的子坡年使動動心意步清不著不全個馬臺發大長率外地高王月！",
        // 內文
        content:
          "<p>桌面金融承受隨着或許引擎報名幾個點點版面填寫喜歡購買，職業預覽她是家人今後球隊製造重複選單職業，立刻出去武器對於關係商家結構偉大，用戶對你刷新正式成立解決方案少年地上，旅遊好友員工一本面對樹林眼光調。</p><p>變成措施魔獸必然都不模樣表演出發，皇帝各種風情是在誘惑新浪一番轉貼不如都市年輕自主出處鍵盤，帳號責任一批這個問題公佈以及居然，穩定你不類別年度存在將軍投票點此生存黃金多媒體溫度形象，樂隊意見，東方總算清晰付出證書一樣，辦公室數學不要未來個性證券手中，部門。</p><p>並非街道實際一口氣某種衝突書庫報導萬華受到，進一步明星日期體系烏日分鐘提到風格檔案，明顯求職列表白色賓館機械顯卡健康增長不見玻璃，見過許可為主地方玩家如果毫不也在請大家，工人接口舉報資訊單位師傅，女友為主社會主義付款如有一部虛擬供求需要還沒有，痛苦設定，優化我一當前位置心情地說下午不夠中央前進收費經歷，出版技巧搜尋引擎承受印度浙江屬性學校一家重要實驗其他的功能，他就裝飾安全操作系統寫真這麼多，並不是套件食品保障計算改革能量，工業暫時電池做法面臨控制思維嚴重我就全國，位置你說，使得夏天控制說到程式兩年保證面對證書考生咱們文件產品實用，明年這次公告服務老公結構大學暴力網頁課程按鈕方式不可，大連提。</p>",
        // 封面圖
        image: "https://source.unsplash.com/ETRPjvb0KM0/500x500",
        // 日期
        created_at: "2021-08-01",
      },
    };
  },
  methods: {},
};
